{"cursor":"10102","size":15,"audio":[],"currentlang":"en","article":"\n solution by dissolving table salt (NaCl) in water. The salt is the solute and\n the water the solvent.]] , formerly dissolved in crystal of pyrite, is left\n behind after the cubic crystal of pyrite dissolved away. Note a corner of the\n former cube seen in center of rock.]] 'Dissolution' is the process by which a\n solute forms a solution in a solvent. The solute, in the case of solids, has\n its crystalline structure disintegrated as separate ions, atoms, and molecules\n form. For liquids and gases, the molecules must be adaptable with those of the\n solvent for a solution to form. The outcome of the process of dissolution (the\n amount dissolved at equilibrium, i.e., the solubility) is governed by the\n thermodynamic energies involved, such as the heat of solution and entropy of\n solution, but the dissolution itself (a kinetic process) is not. Overall the\n free energy must be negative for net dissolution to occur. In turn, those\n energies are controlled by the way in which different chemical bond types\n interact with those in the solvent. Solid solutions occur in metal alloys and\n their formation and description is governed by the relevant phase diagram.\n\nDissolution process is of fundamental importance to the description of numerous\nnatural processes on earth, and it is commonly utilized by humans. Dissolution\ntesting is widely used in the pharmaceutical industry for optimization of\nformulation and quality control.\n\nIn other words, Chemical dissolution.\n\nChemical etching is basically a process used to remove selectively controlled\namounts of material from the substrate by a solution. The etch depth can be\ndesigned to be just tens of angstroms or up to a few hundred of micrometers.\nConcerning the fabrication of microelectronic devices, the etching process is\nvery important at different fabrication stages. Errors during the etching\nprocess will severely impair the performance of devices. More than that, due to\nthe disadvantages of dry etching, among which is the need for specialized and\nexpensive equipment, chemical etching is still unavoidable.\n\nNon-oxidative chemical etching is a potential-independent dissolution and does\nnot involve exchange of free charge carriers between the solid and solution.\nThis concept was introduced for III-V compounds by Gerischer et al. They\nsuggested that during a purely chemical etching process a synchronous bond-\nexchange occurs. As a result, the bonds between the atoms in the solid break and\nnew bonds are formed with reactive molecules from the electrolyte.\n\nIn order to etch chemically a III-V compound according to Gerischers model, it\nis necessary to have a non-oxidizing chemical enchant, such as undissociated\nmolecules of HCl, HBr, Br2 etc. These molecules should be capable to break the\nIII-V bonds and consequently to saturate the resulting dangling bonds.\nTherefore, the chemical etching rate depends strongly on the concentration of\nundissociated molecules in the electrolyte. It is well known that the number of\nundissociated acid molecules (HCl, HBr) increases in aqueous solutions by\nincreasing the concentration of the acid. On the other hand, the number of\nundissociated molecules can be also increased by using a solvent like acetic\nacid instead of water. Consequently, in such solutions the chemical etch rate\nwill be strongly increased.\n\nA chemical dissolution reaction is usually divided in some slow and fast\nreaction steps. The slowest step in the whole process is the rate determining\none. For example, during the chemical reaction of GaAs in H2O2 solution,\nbreaking of a Ga-As bond, followed by the formation of GaOH and AsOH bonds, is\nthe rate-determining step. The subsequent steps are much faster than the first\none, therefore they do not contribute much to the overall dissolution rate.\n\nFor pore formation purposes, chemical etching can be used as a pre-anodization\ntreatment, e.g., for generation of randomly or uniformly distributed defects at\nthe surface of the samples, in order to improve the nucleation stage of the pore\nformation process. Pyramid-like pits on Si surfaces, formed by means of a mask\nand applied chemical etching in KOH solutions, are good examples for controlled\ngeneration of surface defects by means of pure chemical etching.\n\nIt is important to note that chemical etching can significantly influence the\ntotal etching rate of III-V semiconductors during the pore formation process.\nThis should be taken into account when choosing the concentration of the\nelectrolyte for electrochemical etching. By increasing the concentration of the\nacid in solution, the number of undissociated acid molecules increases as well,\nand thus the chemical etch reaction can proceed in parallel with the\nelectrochemical etch reaction. This is normally not desired during a pore\nformation process due to the fact that a chemical reaction is less anisotropic\nas compared with electrochemical ones. This could increase uncontrollably the\ndiameters of the pores up to the destruction of the porous structure.\n\nHowever, chemical reactions could be of interest for increasing pore diameters\nafter the porous structure was already formed. Porous silicon, the pore wall\nthicknesses are mainly determined by the double width of the space charge\nregion. Thus, for a given doping of the substrate we do not have the freedom to\ndecrease the pore walls arbitrarily. This barrier can be overcome by chemical\netching after the electrochemical process finishes.\n","linknr":157,"url":"Dissolution__(chemistry)","recorded":1362889511,"links":23,"instances":[],"pdf":[],"categories":["Physical chemistry"],"headings":["Ionic compounds","Polar compounds","Polymers","Liquids","Gases","Rate of dissolution","References","See also"],"image":["//upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png","//upload.wikimedia.org/wikipedia/commons/thumb/8/89/SaltInWaterSolutionLiquid.jpg/200px-SaltInWaterSolutionLiquid.jpg","//bits.wikimedia.org/static-1.21wmf10/skins/common/images/magnify-clip.png","//upload.wikimedia.org/wikipedia/commons/thumb/9/9a/GoldinPyriteDrainage_acide.JPG/250px-GoldinPyriteDrainage_acide.JPG","//bits.wikimedia.org/static-1.21wmf10/skins/common/images/magnify-clip.png","//upload.wikimedia.org/math/e/b/e/ebe1915c432cf9c372b4ecfe36ff1fa2.png","//upload.wikimedia.org/math/e/4/d/e4df0afb9dde151b2e6de47a7cf9c2ca.png","//upload.wikimedia.org/math/c/6/1/c616ddba5359d19fba83846ff532cb55.png","//bits.wikimedia.org/static-1.21wmf10/skins/vector/images/search-ltr.png?303-4","//bits.wikimedia.org/images/wikimedia-button.png","//bits.wikimedia.org/static-1.21wmf10/skins/common/images/poweredby_mediawiki_88x31.png"],"tags":[],"members":[],"related":["Table_salt","Sodium_chloride","Water","Pyrite","Cubic_crystal_system","Solute","Solution","Solvent","Solubility","Thermodynamic","Heat_of_solution","Entropy","Solution","Thermodynamic_free_energy","Chemical_bond","Solid_solution","Metal_alloy","Phase_diagram","Ionic_compound","Polarity","Water","Ammonia","Activity_coefficient","Potential_Determining_Ion","Solvent","Water","Solvation","Coordination_complex","Electron","Oxygen","Polymers","Hildebrand_solubility_parameter","Hydrogen_bond","Noyes-Whitney_Equation","Diffusion_coefficient","Diffusion","United_States_Pharmacopeia","Solvation","Solubility","Solubility_parameter","Solubilization"]}